Test for ov-highligher.

No highlights are saved.

#+BEGIN_SRC emacs-lisp
(ov-highlight-get-highlights)
#+END_SRC

#+RESULTS:
| 13 | 22 | (ov-type typo ov-highlight t help-echo tpyo face (:background PaleVioletRed1)) |

So I can see we have a highlight.

Problem solved, needed to quote a symbol.

Some tests

green
pink
yellow
color


Copy will take highlights with it
green
pink
yellow
color

And cut works too.
green
pink
yellow
color



little font
big font

strike
underline
box
comic sans font

A comment

delete

insert

#  ov-highlight-data: KCg1MjEgNTI3IChvdi10eXBlICJpbnNlcnQiIG92LWhpZ2hsaWdodCB0IGZhY2UgKDpmb3JlZ3JvdW5kICJibHVlIikpKSAoNTEzIDUxOSAob3YtdHlwZSAiZGVsZXRlIiBvdi1oaWdobGlnaHQgdCBmYWNlICg6Zm9yZWdyb3VuZCAicmVkIiA6c3RyaWtlLXRocm91Z2ggdCkpKSAoNTAyIDUxMSAob3YtdHlwZSAiY29tbWVudCIgb3YtaGlnaGxpZ2h0IHQgaGVscC1lY2hvICJ3aGF0IHdvdWxkIHlvdSBsaWtlIHRvIHNlZT8iIGxvY2FsLW1hcCAoa2V5bWFwIChtb3VzZS0xIGxhbWJkYSBuaWwgKGludGVyYWN0aXZlKSAoc2V0cSAqb3Ytd2luZG93LWNvbmZpZ3VyYXRpb24qIChjdXJyZW50LXdpbmRvdy1jb25maWd1cmF0aW9uKSkgKGxldCAoKGNiIChjdXJyZW50LWJ1ZmZlcikpIChjdXJyZW50LW5vdGUgKG92ZXJsYXktZ2V0IChvdi1hdCkgKHF1b3RlIGhlbHAtZWNobykpKSkgKHN3aXRjaC10by1idWZmZXIgIipvdi1ub3RlKiIpIChlcmFzZS1idWZmZXIpIChvcmctbW9kZSkgKGluc2VydCAob3IgY3VycmVudC1ub3RlICIiKSkgKGxldCAoKG1hcCAobWFrZS1zcGFyc2Uta2V5bWFwKSkpIChzZXRxIGhlYWRlci1saW5lLWZvcm1hdCAiQ2xpY2sgaGVyZSBvciB0eXBlIHMtPHJldHVybj4gdG8gZmluaXNoLiBDLXggayB0byBjYW5jZWwuIikpIChsb2NhbC1zZXQta2V5IChrYmQgIkMteCBrIikgKFxgIChsYW1iZGEgbmlsIChpbnRlcmFjdGl2ZSkgKGtpbGwtYnVmZmVyKSkpKSAobG9jYWwtc2V0LWtleSAoa2JkICJzLTxyZXR1cm4+IikgKFxgIChsYW1iZGEgbmlsIChpbnRlcmFjdGl2ZSkgKGxldCAoKHRvb2x0aXAgKGJ1ZmZlci1zdWJzdHJpbmctbm8tcHJvcGVydGllcyAocG9pbnQtbWluKSAocG9pbnQtbWF4KSkpKSAoa2lsbC1idWZmZXIpIChzZXQtd2luZG93LWNvbmZpZ3VyYXRpb24gKm92LXdpbmRvdy1jb25maWd1cmF0aW9uKikgKHNldHEgbipvdi13aW5kb3ctY29uZmlndXJhdGlvbiogbmlsKSAob3ZlcmxheS1wdXQgKG92LWF0KSAocXVvdGUgaGVscC1lY2hvKSB0b29sdGlwKSkpKSkpKSkgbW91c2UtZmFjZSBoaWdobGlnaHQgZmFjZSAoOmJhY2tncm91bmQgIk9yYW5nZTEiKSkpICg0ODUgNTAwIChvdi10eXBlICJmb250IiBvdi1oaWdobGlnaHQgdCBmYWNlICg6ZmFtaWx5ICJDb21pYyBTYW5zIE1TIikpKSAoNDgxIDQ4NCAob3YtdHlwZSAiYm94IiBvdi1oaWdobGlnaHQgdCBmYWNlICg6Ym94IHQpKSkgKDQ3MSA0ODAgKG92LXR5cGUgInVuZGVybGluZSIgb3YtaGlnaGxpZ2h0IHQgZmFjZSAoOnVuZGVybGluZSB0KSkpICg0NjQgNDcwIChvdi10eXBlICJzdHJpa2V0aHJvdWdoIiBvdi1oaWdobGlnaHQgdCBmYWNlICg6c3RyaWtlLXRocm91Z2ggdCkpKSAoNDU4IDQ2MiAob3YtaGlnaGxpZ2h0IHQgZmFjZSAoOmhlaWdodCAyMzEpKSkgKDQ0OSA0NTMgKG92LWhpZ2hsaWdodCB0IGZhY2UgKDpoZWlnaHQgODQpKSkgKDQzMyA0MzggKGZhY2UgKDpiYWNrZ3JvdW5kICJsaW1lIGdyZWVuIikgb3YtaGlnaGxpZ2h0IHQgb3YtdHlwZSAiY29sb3IiKSkgKDQyNiA0MzIgKGZhY2UgKDpiYWNrZ3JvdW5kICJZZWxsb3ciKSBvdi1oaWdobGlnaHQgdCBvdi10eXBlICJ5ZWxsb3ciKSkgKDQyMSA0MjUgKGZhY2UgKDpiYWNrZ3JvdW5kICJQaW5rIikgb3YtaGlnaGxpZ2h0IHQgb3YtdHlwZSAicGluayIpKSAoNDE1IDQyMCAoZmFjZSAoOmJhY2tncm91bmQgIkRhcmtvbGl2ZWdyZWVuMSIpIG92LWhpZ2hsaWdodCB0IG92LXR5cGUgImdyZWVuIikpICgxMyAyMiAob3YtdHlwZSAidHlwbyIgb3YtaGlnaGxpZ2h0IHQgaGVscC1lY2hvICJ0cHlvIiBmYWNlICg6YmFja2dyb3VuZCAiUGFsZVZpb2xldFJlZDEiKSkpICgzMTEgMzE2IChmYWNlICg6YmFja2dyb3VuZCAiRGFya29saXZlZ3JlZW4xIikgb3YtaGlnaGxpZ2h0IHQgb3YtdHlwZSAiZ3JlZW4iKSkgKDMxNyAzMjEgKGZhY2UgKDpiYWNrZ3JvdW5kICJQaW5rIikgb3YtaGlnaGxpZ2h0IHQgb3YtdHlwZSAicGluayIpKSAoMzIyIDMyOCAoZmFjZSAoOmJhY2tncm91bmQgIlllbGxvdyIpIG92LWhpZ2hsaWdodCB0IG92LXR5cGUgInllbGxvdyIpKSAoMzI5IDMzNCAoZmFjZSAoOmJhY2tncm91bmQgImxpbWUgZ3JlZW4iKSBvdi1oaWdobGlnaHQgdCBvdi10eXBlICJjb2xvciIpKSAoMzcxIDM3NiAoZmFjZSAoOmJhY2tncm91bmQgIkRhcmtvbGl2ZWdyZWVuMSIpIG92LWhpZ2hsaWdodCB0IG92LXR5cGUgImdyZWVuIikpICgzNzcgMzgxIChmYWNlICg6YmFja2dyb3VuZCAiUGluayIpIG92LWhpZ2hsaWdodCB0IG92LXR5cGUgInBpbmsiKSkgKDM4MiAzODggKGZhY2UgKDpiYWNrZ3JvdW5kICJZZWxsb3ciKSBvdi1oaWdobGlnaHQgdCBvdi10eXBlICJ5ZWxsb3ciKSkgKDM4OSAzOTQgKGZhY2UgKDpiYWNrZ3JvdW5kICJsaW1lIGdyZWVuIikgb3YtaGlnaGxpZ2h0IHQgb3YtdHlwZSAiY29sb3IiKSkp

# Local Variables:
# eval: (ov-highlight-load)
# End:
